js_project_test_backend/app/controllers/api/v1/problems_controller.rb

    def create

        @problem = Problem.create(problem_params)
---
INSERT INTO "problems" ("name", "description", "user_id") VALUES (?, ?, ?)  [["name", "covid19"], ["description", "who has it?"], ["user_id", 1]]

    def destroy
        #byebug
        @problem = Problem.find_by(id: params[:id]).destroy
---
DELETE FROM "problems" WHERE "problems"."id" = ?  [["id", 8]]
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]