js_project_test_backend/app/controllers/api/v1/users_controller.rb

    def create
        #binding.pry
        if User.find_by(:name => user_params[:name])
            user = User.find_by(:name => user_params[:name])
            redirect_to "/api/v1/users/#{user.id}"
        else
            user = User.create(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Alex"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Tyler"], ["LIMIT", 1]]
INSERT INTO "users" ("name") VALUES (?)  [["name", "Tyler"]]

    def show
        user = User.find_by(:id => params[:id].to_i)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]